"""
全局常量
"""

# ================== Community Start ====================
# 社团类型
COMMUNITY_TYPE = (
    (1, '学习类'),
    (2, '语言类'),
    (3, '艺术类'),
    (4, '户外类'),
    (5, '体育类'),
    (6, '其他')
)

# 社团相关文件类型
COMMUNITY_FILE_TYPE = (
    (0, '社团导师简历'),
    (1, '社团简章'),
    (2, '社团规章制度'),
    (3, '其他')
)

# 申请状态
APPLY_STATUS = (
    (0, '已申请'),
    (1, '处理中'),
    (2, '未通过'),
    (3, '已通过')
)

# 申请类型
APPLY_TYPE = (
    (0, '申请加入社团'),
    (1, '申请创建社团'),
    (2, '申请退出社团')
)
# ================== Community END   ====================

# ================== USER START =========================
# 角色
ROLE = (
    (0, '普通用户'),
    (1, '社团成员'),
    (2, '社长'),
    (3, '社团运营监管人员'),
    (4, '超级管理员'),
)

# ================== USER END   =========================

# ================== DATA START =========================
# 资料状态
DATA_STATUS = (
    (0, '未处理'),
    (1, '处理中'),
    (2, '未通过'),
    (3, '已通过')
)

# 公开度
DISCLOSURE = (
    (0, '所有人可见'),
    (1, '仅所在社团人员可见')
)
# ================== DATA END   =========================

# ================== PROJECT START ======================
# 项目状态
PROJECT_STATUS = (
    (0, '悬赏中'),
    (1, '已承接'),
    (2, '已完成'),
    (3, '未处理'),
    (4, '未通过')
)

# 资料包类型
PACKAGE_SCOPE = ('application/zip', 'application/x-tar')

# 资料包的大小
PACKAGE_SIZE = 50 * 1024 * 1024

# 上传图片的大小限制
IMAGE_SIZE = 10 * 1024 * 1024

# 上传图片类型限制
IMAGE_SCOPE = ('image/jpeg', 'image/jpg', 'image/png')
# ================== PROJECT END   ======================


